driver-tests/bpelse/benchmark/BenchmarkJbi/test/benchMarkInvoke/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://localhost/MultiDepBpel/benchMark">
  <soapenv:Body>
    <tns:benchMarkElement>
      <tns:string>input</tns:string>
      <tns:waitTime>P0Y0DT1S</tns:waitTime>
      <tns:payLoad>This is test payload</tns:payLoad>
      <tns:payLoad>This is test payload</tns:payLoad>
      <tns:payLoad>This is test payload</tns:payLoad>
      <tns:payLoad>This is test payload</tns:payLoad>
    </tns:benchMarkElement>
  </soapenv:Body>
</soapenv:Envelope>