driver-tests/bpelse/systemicqualities/Redelivery/RedeliverWithinRetriesJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ben="http://localhost/MultiDepBpel/benchMark">
  <soapenv:Body>
    <ben:benchMarkElement>
      <ben:string>input</ben:string>
      <ben:waitTime>P0Y0DT1S</ben:waitTime>
      <ben:payLoad>This is test payload</ben:payLoad>
      <ben:payLoad>This is test payload</ben:payLoad>
      <ben:payLoad>This is test payload</ben:payLoad>
      <ben:payLoad>This is test payload</ben:payLoad>
    </ben:benchMarkElement>
  </soapenv:Body>
</soapenv:Envelope>